app/Controllers/Home.php

    public function index(): string
    {
        $produtoModel = new ProdutoModel();
        $vendaModel   = new VendaModel();

        $totalProdutos = $produtoModel->countAllResults();
        $totalVendas   = $vendaModel->countAllResults();
        $faturamento   = (float) ($vendaModel->selectSum('total')->first()['total'] ?? 0);

        $ultimasVendas = $vendaModel->orderBy('created_at', 'DESC')->findAll(5);
---
SELECT COUNT(*) AS `numrows`
FROM `produtos`
SELECT COUNT(*) AS `numrows`
FROM `vendas`
SELECT SUM(`total`) AS `total`
FROM `vendas`
 LIMIT 1
SELECT *
FROM `vendas`
ORDER BY `created_at` DESC
 LIMIT 5