app/Controllers/Loja.php

SELECT *
FROM `produtos`
ORDER BY `id` ASC
---
    public function index(): string
    {
        return view('loja/index', [
            'title'    => 'Início',
            'produtos' => $this->produtos->orderBy('id', 'ASC')->findAll(),

SELECT *
FROM `produtos`
WHERE `produtos`.`id` = 35
SELECT *
FROM `produtos`
WHERE `id` != 35
ORDER BY RAND()
 LIMIT 3
---
    public function produto(int $id): string
    {
        $produto = $this->produtos->find($id);

        if (! $produto) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $relacionados = $this->produtos
            ->where('id !=', $id)
            ->orderBy('RAND()')
            ->findAll(3);

SELECT *
FROM `produtos`
WHERE `produtos`.`id` = 39
---
    public function adicionar()
    {
        $id  = (int) $this->request->getPost('produto_id');
        $qtd = max(1, (int) $this->request->getPost('quantidade'));

        $produto = $this->produtos->find($id);