app/Controllers/Produtos.php

SELECT *
FROM `produtos`
ORDER BY `nome` ASC
---
    public function index(): string
    {
        return view('produtos/index', [
            'title'    => 'Produtos',
            'produtos' => $this->produtos->orderBy('nome', 'ASC')->findAll(),

INSERT INTO `produtos` (`nome`, `descricao`, `preco`, `estoque`, `created_at`, `updated_at`) VALUES ('Camiseta Branca ', 'Camiseta premium em algodão penteado.', '99', '14', '2026-06-27 21:21:56', '2026-06-27 21:21:56')
---
    public function salvar()
    {
        $dados = $this->request->getPost(['nome', 'imagem', 'descricao', 'preco', 'estoque']);

        if (! $this->produtos->save($dados)) {